import type { ReactNode } from "react";
import Link from "next/link";

export interface Update {
  version: string;
  date: string;
  changes: ReactNode[];
  video?: string;
  image?: string;
}

export const updates: Update[] = [
  {
    version: "2.0.0",
    date: "۲۱ اردیبهشت ۱۴۰۵",
    changes: [
      "۱. اضافه شدن قابلیت جستجو در اشعار و شاعران برای پیدا کردن سریع‌تر شعر یا شاعر مورد نظر.",
      "۲. اضافه شدن شاعران نو از اکولالیا.",
      "۳. ضفحه تنظیمات همراه با امکان شخصی‌سازی قالب و فونت.",
      "۴. شخصی‌سازی شاعرهای صفحه اصلی، انتخاب از هر سه منبع شعر.",
      "۵. پشتیبانی از کتاب‌های شاعرها، در صورت دردسترس بودن.",
      "۶. امکان اشتراک‌گذاری اشعار به صورت تصویر.",
      "۷. نمایش شماره ابیات",
      "و رفع مشکلات و بهبودهای جزئی.",
    ],
  },
  {
    version: "1.2.0",
    date: "۲۳ مرداد ۱۴۰۴",
    changes: [
      "امکان انتخاب تم دلخواه (تاریک، روشن و کاغذی) از منو و ذخیره شدن آن برای دفعات بعد.",
      "نمایش اختیاری شمارهٔ مصرع‌ها برای دنبال کردن بهتر متن شعر.",
      "نمایش اعلان برای بروزرسانی‌های جدید و هماهنگی آن بین صفحات مختلف.",
      "پیش‌بارگذاری مسیرها برای رفت‌وآمد سریع‌تر بین صفحات و پروفایل شاعر.",
    ],
  },
  {
    version: "1.1.1",
    date: "۲۲ مرداد ۱۴۰۴",
    changes: ["اضافه شدن پوسته روشن."],
    image: "/images/updates/light-theme.jpg",
  },
  {
    version: "1.1.0",
    date: "۲۰ مرداد ۱۴۰۴",
    changes: [
      "هماهنگ‌‌و‌برجسته‌سازی مصرع‌ها همراه با پخش‌شدن خوانش‌ها. دکمه‌ای هم تعبیه شده تا بتونید این ویژگی رو خاموش کنید.",
    ],
    video: "/videos/sync.mp4",
  },
  {
    version: "1.0.3",
    date: "۱۸ مرداد ۱۴۰۴",
    changes: [
      "حالا با اضافه کردن gnjk.ir یا ganjoorak.ir به پشت دامنه گنجور، در هر شعری، آن را در گنجورک ببینید و گوش کنید.",
    ],
    video: "/videos/redirect.mp4",
  },
  {
    version: "1.0.2",
    date: "۲۷ اسفند ۱۴۰۳",
    changes: [
      <>
        اضافه شدن{" "}
        <Link href="/poets" className="link">
          صفحه شاعران
        </Link>
      </>,
      <>
        اضافه شدن دو شاعر معاصر،{" "}
        <Link href="/rahmani" className="link">
          نصرت رحمانی
        </Link>{" "}
        و{" "}
        <Link href="/farrokhzad" className="link">
          فروغ فرخزاد
        </Link>
      </>,
      "اضافه شدن صفحه جدید برای هر شاعر با کلیک در صفحه اصلی یا صفحه شاعران",
      "اضافه شدن منو",
      "اصلاح نیم‌فاصله‌ها",
      "پیمایش بین شعرها و محتوای شعرها با کیبورد",
    ],
  },
  {
    version: "1.0.1",
    date: "۲۵ اسفند ۱۴۰۳",
    changes: [
      <>
        اضافه شدن{" "}
        <Link href="/faq" className="link">
          صفحه پرسش‌های متداول
        </Link>
      </>,
      <>
        اضافه شدن{" "}
        <Link href="/updates" className="link">
          صفحه بروزرسانی‌ها
        </Link>
      </>,
      "بهبود رابط کاربری و انیمیشن‌ها",
      "رفع باگ‌های جزئی",
    ],
  },
  {
    version: "1.0.0",
    date: "۲۰ اسفند ۱۴۰۳",
    changes: [
      "انتشار نسخه اولیه گنجورک",
      "امکان مشاهده اشعار به صورت تصادفی",
      "پخش صوت اشعار",
    ],
  },
];

export const latestUpdateVersion = updates[0]?.version ?? "";
